<template >
  <v-sheet class="brown lighten-5">
    <v-container>
      <v-tabs
      v-model="tab"
      background-color="transparent"
      color="primary"
      grow>
        <v-tab v-for="item in items" :key="item">
          {{ item }}
        </v-tab>
      </v-tabs>
      <v-card v-if="tab==0">
        <v-row>
          <v-col
          cols="12"
          xl="6"
          lg="6"
          md="12"
          sm="12"
          xs="12">
            <v-img contain aspect-ratio="1.5" src="https://www.velosklad.ru/images/delivery-map.png" />
          </v-col>
          <v-col>
            <v-card-title>Доставка велосипедов по Москве</v-card-title>
            <v-card-text class="text-lg-subtitle-1">
              <p>Ежедневная доставка велосипедов и аксессуаров в границах города Москва (МКАД) производится до подъезда дома с 10:00 до 24:00 (примерное время доставки согласовывается с менеджером по телефону)</p>
              <p>Доставка заказа по одному адресу - бесплатно. Установка аксессуаров на велосипед (платно) или укомплектовывание велосипеда светоотражателями (бесплатно) производиться только по cогласованию с менеджером при оформлении заказа. Доставка осуществляется до подъезда. Стоимость подъема одного велосипеда на любой этаж до квартиры (при наличии лифта) +200 руб. Стоимость подъема одного взрослого трехколесного велосипеда +400 руб.</p>
              <p>Оплату мы принимаем по факту получения заказа (наличные или пластиковые карты), а так же Вы можете заранее предоплатить заказ на сайте любым удобным способом (пластиковые карты, электронные деньги).</p>
              <p>Мы осуществляем доставку в абсолютно готовом виде (что предполагает полную сборку и настройку). Заказ может быть сделан путем заполнения формы на сайте в соответствии с выбранной моделью велосипеда либо по телефону. Минимальная сумма заказа 1000 руб.</p>
              <p>Сроки доставки (в днях): по городу Москва - один-два; по Московской области - один-три. Отсчет времени - момент заказа.</p>
              <p>Доставка в день заказа! При заказе до 18.00 товар доставляется в день заказа (при наличии товара)! При заказе нужно указать в примечении "Доставка в день заказа". Стоимость +800 руб.</p>
            </v-card-text>
            <v-card-title>Доставка по Московской области</v-card-title>
            <v-card-text class="text-lg-subtitle-1">
              Мы производим доставку заказов до 30 000 руб. за границами МКАД по тарифу 25 руб./1км от МКАД (для заказов от 30 000 руб: 15 руб./1км от МКАД). При удаленности от МКАД более 80 км, стоимость и срок доставки уточняется индивидуально.
            </v-card-text>
          </v-col>
        </v-row>
      </v-card>
      <v-card v-if="tab==1">
        <v-row>
          <v-col
          cols="12"
          xl="6"
          lg="6"
          md="12"
          sm="12"
          xs="12">
            <v-card-title>
              Процесс доставки состоит из нескольких этапов:
            </v-card-title>
            <v-timeline dense>
              <v-timeline-item icon="mdi-numeric-1">
                Для заказа необходимо оформить заявку через сайт: положить товары в корзину на сайте, затем оформить заказ.
              </v-timeline-item>
              <v-timeline-item icon="mdi-numeric-2">
                Затем Вам необходимо оплатить заказ.
              </v-timeline-item>
              <v-timeline-item icon="mdi-numeric-3">
                Отправка заказа происходит после оплаты.
              </v-timeline-item>
              <v-timeline-item icon="mdi-numeric-4">
                Доставка осуществляется транспортными компаниями, занимающимися отправкой грузов, с которыми мы работаем: «Энергия», «Байкал Сервис», «Деловые Линии», «ЖелДорЭкспедиция», «ПЭК», «Vozovoz» , «GTD» , «Стеил» и другие.
              </v-timeline-item>
              <v-timeline-item icon="mdi-numeric-5">
                Получение происходит в филиале транспортной компании вашего города. При поступлении заказа на место назначения, сотрудники транспортной компании вашего города оповещают Вас по телефону. Получение происходит по паспорту.
              </v-timeline-item>
            </v-timeline>
          </v-col>
          <v-col>
            <v-card-title> Стоимость доставки в регионы</v-card-title>
            <v-card-text class="text-lg-subtitle-1">
              <p>Стоимость доставки одного взрослого двухколесного велосипеда рассчитывается для каждого города индивидуально.</p>
              <p>Размеры коробки стандартного взрослого двухколесного велосипеда: 1.3 м. на 0.22 м. на 0.7 м. Объем таким образом составляет 0.2 кубических метра.</p>
              <p>Доставка аксессуаров вместе с велосипедами, (кроме детских кресел), производится бесплатно.</p>
            </v-card-text>
          </v-col>
        </v-row>
      </v-card>
      <v-card v-if="tab==2">
        <v-row justify="center">
          <v-col
          cols="12"
          xl="6"
          lg="6"
          md="12"
          sm="12"
          xs="12"
          >
            <v-card-title>Доставка в пункты самовывоза! </v-card-title>
            <v-card-text>Теперь Вы можете заказать доставку в пункт самовывоза (более 25 пунктов по Москве и области)! Доставка заказов в пункты самовывоза производится только после подтверждения нашего менеджера! Положите товар в корзину, затем (при оформлении заказа) выберите нужный Вам пункт самовывоза, оплатите заказ на сайте, наш менеджер перезвонит Вам в течение 1 часа (в рабочее время)! Вес товара не более 20 кг. Обратите внимание, при доставке в пункт самовывоза, заказ должен быть предоплачен на сайте!</v-card-text>
          </v-col>
        </v-row>
      </v-card>
    </v-container>
  </v-sheet>
</template>
<script>
export default {
  data(){
    return {
      tab: null,
      items: [
        'Доставка по Москве', 'Доставка по России', 'Самовывоз'
      ],
    }
  }
}
</script>
