<template >
  <v-sheet class="brown lighten-5">
    <v-container>
      <v-row justify="center">
        <v-col
        cols="12"
        xl="6"
        lg="8"
        md="10"
        sm="12"
        xs="12"
        >
          <v-card>
            <v-row justify="center">
              <v-col >
                <v-card-title>Как происходит процесс оплаты и доставки?</v-card-title>
                <v-card-text>Весь процесс состоит из 4 этапов: оплата, отправка, доставка, получение заказа. Оплата проходит сразу (при оплате по карте) или в течении суток (при оплате в банке по квитанции). Отправка заказа производиться после поступления оплаты. Доставка осуществляется транспортными компаниями, занимающимися отправкой грузов, с которыми мы работаем. Срок доставки зависит от вашего города, он указан на нашем сайте. При поступлении заказа сотрудники транспортной компании вашего города оповещают Вас по телефону о возможности получения. Получение происходит по паспорту.</v-card-text>
                <v-card-title>Соответствуют ли реальные сроки доставки срокам, указанным на вашем сайте?</v-card-title>
                <v-card-text>Длительность доставки, действительно соответствует, срокам, указанным на сайте. Срок определяется с момента отправки до момента поступления заказа в филиал транспортной компании в вашем городе. Отправка происходит в течение 5 рабочих дней после поступления оплаты (в большинстве случаев мы отправляем заказ быстрее - в течение 2 дней).</v-card-text>
                <v-card-title>Какие гарантии того, что заказ будет в целости доставлен и полностью соответствовать описанию?</v-card-title>
                <v-card-text>Гарантиями качества доставки служит страховка заказа, включенная в стоимость доставки. Гарантиями качества товара служит многолетняя репутация нашего магазина, в том числе рейтинг на «Яндекс.Маркет», сертификат «Надежная покупка» и отзывы о нашем магазине в интернете. У нас не было еще ни одного случая, когда заказ потерялся или не был получен.</v-card-text>
                <v-card-title>Я могу оплатить заказ, после получения в своем городе?</v-card-title>
                <v-card-text>Да, для этого у нас есть услуга наложенный платеж. Данный способ оплаты может использоваться не для всех городов России. Наложенный платеж позволяет оплатить за товар и за доставку при получении в филиале транспортной компании вашего города. При данном способе оплаты, сумма заказа должна быть не менее 50000 руб. Заказы стоимостью менее 50000 руб. через наложенный платеж не доставляются. При оплате через наложенный платеж действуют особые тарифы на доставку, которые превышают примерно на 50% тарифы обычных транспортных компаний (например, доставка 1 заказа, если оплачивать в банке по квитанции (предоплата) стоит 1000 руб., а если оплачивать через наложенный платеж (при получении) стоимость доставки (из-за комиссии агента) увеличивается до 1500 руб.). При оплате через наложенный платеж агентом так же взимается комиссия +3% от стоимости заказа. За дополнительную плату (для некоторых городов) возможна доставка до двери с оплатой при получении.</v-card-text>
                <v-card-title>Как оплатить, если у меня нет пластиковой карты и открытого счета в банке?</v-card-title>
                <v-card-text>Самым простым способом является оплата по квитанции в любом банке РФ. Вам не обязательно иметь свой электронный счет. Для перечисления средств достаточно знать номер расчетного счета. Перевод может осуществляться любом банке вашего города.</v-card-text>
                <v-card-title>Как оплачивается доставка аксессуаров и запчастей?</v-card-title>
                <v-card-text>Если в Вашем заказе дополнительно присутствуют аксессуары и запчасти, то стоимость доставки не увеличивается. Если заказ состоит только из аксессуаров или запчастей, то берется минимальный тариф транспортной компании.</v-card-text>
                <v-card-title>Какая минимальная сумма заказа?</v-card-title>
                <v-card-text>Минимальная сумма заказа – 3000 руб. Заказы стоимостью до 3000 руб. не доставляются</v-card-text>
              </v-col>
            </v-row>
          </v-card>
        </v-col>
      </v-row>
    </v-container>
  </v-sheet>
</template>
<script>
